#### FaceSilhouetteNode Members

---

|  |
| --- |
| FaceSilhouetteNode Class   Methods   Properties   See Also |

The  FaceSilhouetteNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFace | Returns the Face object corresponding to the node. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetInstanceTransform | Returns instance transform of the object being drawn. (Inherited from  FaceDetailNode  .) |
| Public method | GetLinkTransform | Returns link transform of the object being drawn. (Inherited from  FaceDetailNode  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | LineProperties | Access to the line (pen) properties of the curve being drawn. (Inherited from  FaceDetailNode  .) |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |

# See Also

FaceSilhouetteNode Class

Autodesk.Revit.DB Namespace